zhangqiaoli/xlightRemote-stm8l/Project/src/button.c
/*
 xlight remoter button functions

- Dimmer keys:
      PD2 -> keyUp
      PD3 -> keyDown
      PD0 -> keyLeft
      PD1 -> KeyRight
      PB0 -> KeyCenter

  - Functuon keys:
      PB1 -> Fn1
      PB2 -> Fn2
      PB3 -> Fn3
      //PD6 -> Fn4

LEDs
  Flashlight (White LED) -> PC1
  On/Off (Green LED) -> PC6
  Device Selection (Red LEDs) -> PC0 to PC3

*/

#include "_global.h"
#include "PPTCtrl_Protocol.h"
#include "stm8l15x.h"
#include "stm8l15x_gpio.h"
#include "stm8l15x_exti.h"

#include "timer.h"
#include "button.h"
#include "ProtocolParser.h"

//---------------------------------------------------
// PIN Map
//---------------------------------------------------
// LED pin map
#define LEDS_PORT               (GPIOC)
#define LED_PIN_LASERPEN        (GPIO_Pin_0)
#define LED_PIN_FLASHLIGHT      (GPIO_Pin_1)

// Button pin map
#define BUTTONS_PORT1           (GPIOD)
#define BUTTONS_PORT2           (GPIOB)

// Port 1    
#define BUTTON_PIN_UP           (GPIO_Pin_0)
#define BUTTON_PIN_DOWN         (GPIO_Pin_1)
#define BUTTON_PIN_LEFT         (GPIO_Pin_2)
#define BUTTON_PIN_RIGHT        (GPIO_Pin_3)

#ifndef PCB_10_BUTTONS
#define BUTTON_PIN_SB           (GPIO_Pin_4)
#endif

#define BUTTON_PIN_FN4          (GPIO_Pin_6)
#define BUTTON_PIN_SA           (GPIO_Pin_7)

// Port 2
#define BUTTON_PIN_CENTER       (GPIO_Pin_0)
#define BUTTON_PIN_FN1          (GPIO_Pin_1)
#define BUTTON_PIN_FN2          (GPIO_Pin_2)
#define BUTTON_PIN_FN3          (GPIO_Pin_3)
//---------------------------------------------------

// Set LED pin status
#define ledSetPin(x, pin)       GPIO_WriteBit(LEDS_PORT, pin, ((x) > 0 ? SET : RESET))
#define ledFlashLight(x)        ledSetPin(x, LED_PIN_FLASHLIGHT)
#define ledToggleFlashLight     GPIO_ToggleBits(LEDS_PORT, LED_PIN_FLASHLIGHT)
#define ledLaserPen(x)          ledSetPin(x, LED_PIN_LASERPEN)
#define ledToggleLaserPen       GPIO_ToggleBits(LEDS_PORT, LED_PIN_LASERPEN)

// Get Button pin input
#define pinKeyUp                ((BitStatus)(BUTTONS_PORT1->IDR & (uint8_t)BUTTON_PIN_UP))
#define pinKeyDown              ((BitStatus)(BUTTONS_PORT1->IDR & (uint8_t)BUTTON_PIN_DOWN))
#define pinKeyLeft              ((BitStatus)(BUTTONS_PORT1->IDR & (uint8_t)BUTTON_PIN_LEFT))
#define pinKeyRight             ((BitStatus)(BUTTONS_PORT1->IDR & (uint8_t)BUTTON_PIN_RIGHT))
#define pinKeyCenter            ((BitStatus)(BUTTONS_PORT2->IDR & (uint8_t)BUTTON_PIN_CENTER))

#define pinKeyFn1               ((BitStatus)(BUTTONS_PORT2->IDR & (uint8_t)BUTTON_PIN_FN1))
#define pinKeyFn2               ((BitStatus)(BUTTONS_PORT2->IDR & (uint8_t)BUTTON_PIN_FN2))
#define pinKeyFn3               ((BitStatus)(BUTTONS_PORT2->IDR & (uint8_t)BUTTON_PIN_FN3))
#define pinKeyFn4               ((BitStatus)(BUTTONS_PORT1->IDR & (uint8_t)BUTTON_PIN_FN4))

#define pinKeySA                ((BitStatus)(BUTTONS_PORT1->IDR & (uint8_t)BUTTON_PIN_SA))

#ifdef BUTTON_PIN_SB
#define pinKeySB                ((BitStatus)(BUTTONS_PORT1->IDR & (uint8_t)BUTTON_PIN_SB))
#endif

#define pinLEDFlashlight        ((BitStatus)(LEDS_PORT->IDR & (uint8_t)LED_PIN_FLASHLIGHT))
#define pinLEDLaserPen          ((BitStatus)(LEDS_PORT->IDR & (uint8_t)LED_PIN_LASERPEN))

#define BUTTON_DEBONCE_DURATION                 3       // The unit is 10 ms, so the duration is 30 ms.
#define BUTTON_WAIT_2S                          100     // The unit is 10 ms, so the duration is 2 s.
#define BUTTON_WAIT_3S                          300     // The unit is 10 ms, so the duration is 3 s.
#define BUTTON_DOUBLE_BTN_DURATION              50      // The unit is 10 ms, so the duration is 500 ms.
#define BUTTON_DOUBLE_BTN_TRACK_DURATION        300     // The unit is 10 ms, so the duration is 3 s.

// Button behavior
#define BTN_STEP_PAGES          5
#define BTN_STEP_SHORT_BR       10
#define BTN_STEP_SHORT_CCT      300
#define BTN_STEP_LONG_BR        25
#define BTN_STEP_LONG_CCT       800
#define BTN_BR_LOW              10

static button_timer_status_t  m_btn_timer_status[keylstDummy] = {BUTTON_STATUS_INIT};
static bool detect_double_btn_press[keylstDummy] = {FALSE};
static bool btn_is_pushed[keylstDummy] = {FALSE};
static uint16_t btn_bit_postion[keylstDummy];

static uint8_t m_timer_id_btn_detet[keylstDummy];
static uint8_t m_timer_id_double_btn_detet[keylstDummy];

static bool double_button_track = FALSE;
static uint16_t button_status = 0xFFFF;
static uint16_t button_first_detect_status = 0xFFFF;

static uint8_t m_timer_id_debonce_detet;

void app_button_event_handler(uint8_t _btn, button_event_t button_event);
void button_push(uint8_t _btn);
void button_release(uint8_t _btn);

// Switch PPT mode
void SwitchPPTMode(bool _sw) {
#ifdef ENABLE_PRESENTATION_MODE  
  gConfig.inPresentation = _sw;
  if( gDelayedOperation == 0 ) {
    gDelayedOperation = _sw ? DELAY_OP_PPTMODE_ON : DELAY_OP_PPTMODE_OFF;
  }
#endif  
}

// Blink LED to indicate starting
void LED_Blink(bool _flash, bool _fast) {
  if( _flash )
    SetFlashlight(DEVICE_SW_ON);
  else
    SetLasterBeam(DEVICE_SW_ON);
  //delay_ms(_fast ? 200 : 500);
  WaitMutex(_fast ? 0x4FFF : 0xBFFF);
  if( _flash )
    SetFlashlight(DEVICE_SW_OFF);
  else
    SetLasterBeam(DEVICE_SW_OFF);
  //delay_ms(_fast ? 200 : 500);
  WaitMutex(_fast ? 0x4FFF : 0xBFFF);
}

// Change device selection LEDs according to current device index
void SelectDeviceLED(uint8_t _dev) {
  switch(_dev) {
  case 1:
    //ledDevice0(0);
    //ledDevice1(1);
    //ledDevice2(0);
    //ledDevice3(0);
    break;
    
  case 2:
    //ledDevice0(0);
    //ledDevice1(0);
    //ledDevice2(1);
    //ledDevice3(0);
    break;

  default:
    //ledDevice0(1);
    //ledDevice1(0);
    //ledDevice2(0);
    //ledDevice3(0);
    break;
  }
}

static void btn_duration_timeout_handler(uint8_t _btn)
{
  // Assert button
  if( !IS_VALID_BUTTON(_btn) ) return;
  
  button_event_t button_event = BUTTON_INVALID;
  switch (m_btn_timer_status[_btn]) {
  case BUTTON_STATUS_INIT:
    break;
    
  case BUTTON_STATUS_LESS_2S:
    button_event = BUTTON_LONG_HOLD;
    timer_start(m_timer_id_btn_detet[_btn], BUTTON_WAIT_3S);
    m_btn_timer_status[_btn] = BUTTON_STATUS_MORE_2S;
    break;
    
