zhangqiaoli/xlightRemote-stm8l/Project/src/button.c
  case BUTTON_STATUS_MORE_2S:
    button_event = BUTTON_VERY_LONG_HOLD;
    m_btn_timer_status[_btn] = BUTTON_STATUS_MORE_5S;
    break;
    
  case BUTTON_STATUS_MORE_5S:
    break;
    
  case BUTTON_STATUS_DOUBLE_TRACK:
    button_event = DOUBLE_BTN_TRACK;
    m_btn_timer_status[_btn] = BUTTON_STATUS_INIT;
    break;
    
  default:
    break;
  }
  
  if( button_event != BUTTON_INVALID ) {
    app_button_event_handler(_btn, button_event);
  }
}

void double_btn_timeout_handler(uint8_t _btn)
{
  // Assert button
  if( !IS_VALID_BUTTON(_btn) ) return;
  
  button_event_t button_event = BUTTON_SHORT_PRESS;
  detect_double_btn_press[_btn] = FALSE;
  m_btn_timer_status[_btn] = BUTTON_STATUS_INIT;
  timer_stop(m_timer_id_double_btn_detet[_btn]);
  app_button_event_handler(_btn, button_event);
}

void btn_debonce_timeout_handler(uint8_t _tag)
{
  uint16_t valid_button;
  uint16_t current_button;
  uint16_t changed_button;
  
  current_button = GPIO_ReadInputData(BUTTONS_PORT1);
  current_button <<= 8;
  current_button |= GPIO_ReadInputData(BUTTONS_PORT2);

  valid_button = ~(current_button ^ button_first_detect_status);    
  changed_button = ((current_button^button_status) & valid_button);
  button_status = current_button;
  
  // Scan all buttons
  uint8_t _btn;
  for( _btn = 0; _btn < keylstDummy; _btn++ ) {    
    if ((changed_button & btn_bit_postion[_btn]) != 0)
    {
      timer_stop(m_timer_id_btn_detet[_btn]);
      if ((current_button & btn_bit_postion[_btn]) == 0)
      {
        button_push(_btn);
      }
      else
      {
        button_release(_btn);
      }
    }
  }
}

void button_init()
{
  uint8_t _btn;
  
  // Set button bit postion
  btn_bit_postion[keylstLeft] = BUTTON_PIN_LEFT;
  btn_bit_postion[keylstLeft] <<= 8;
  btn_bit_postion[keylstRight] = BUTTON_PIN_RIGHT;
  btn_bit_postion[keylstRight] <<= 8;
  btn_bit_postion[keylstUp] = BUTTON_PIN_UP;
  btn_bit_postion[keylstUp] <<= 8;
  btn_bit_postion[keylstDown] = BUTTON_PIN_DOWN;
  btn_bit_postion[keylstDown] <<= 8;
  btn_bit_postion[keylstFn4] = BUTTON_PIN_FN4;
  btn_bit_postion[keylstFn4] <<= 8;
  btn_bit_postion[keylstFLASH] = BUTTON_PIN_SA;
  btn_bit_postion[keylstFLASH] <<= 8;

#ifdef BUTTON_PIN_SB
  btn_bit_postion[keylstLASER] = BUTTON_PIN_SB;
  btn_bit_postion[keylstLASER] <<= 8;
#endif
  
  btn_bit_postion[keylstCenter] = BUTTON_PIN_CENTER;
  btn_bit_postion[keylstFn1] = BUTTON_PIN_FN1;
  btn_bit_postion[keylstFn2] = BUTTON_PIN_FN2;
  btn_bit_postion[keylstFn3] = BUTTON_PIN_FN3;
  
  // Setup Interrupts
  disableInterrupts();
  //GPIO_Init(LEDS_PORT, (LED_PIN_ONOFF | LED_PIN_DEV0 | LED_PIN_DEV1 | LED_PIN_DEV2 | LED_PIN_DEV3), GPIO_Mode_Out_PP_Low_Fast);
#ifdef ENABLE_FLASHLIGHT_LASER  
  GPIO_Init(LEDS_PORT, (LED_PIN_FLASHLIGHT | LED_PIN_LASERPEN), GPIO_Mode_Out_PP_Low_Fast);
#endif
#ifdef BUTTON_PIN_SB
  GPIO_Init(BUTTONS_PORT1, (BUTTON_PIN_LEFT | BUTTON_PIN_RIGHT | BUTTON_PIN_UP | BUTTON_PIN_DOWN | BUTTON_PIN_FN4 | BUTTON_PIN_SA | BUTTON_PIN_SB), GPIO_Mode_In_PU_IT);
#else
  GPIO_Init(BUTTONS_PORT1, (BUTTON_PIN_LEFT | BUTTON_PIN_RIGHT | BUTTON_PIN_UP | BUTTON_PIN_DOWN | BUTTON_PIN_FN4 | BUTTON_PIN_SA), GPIO_Mode_In_PU_IT);
#endif  
  
  GPIO_Init(BUTTONS_PORT2, (BUTTON_PIN_CENTER | BUTTON_PIN_FN1 | BUTTON_PIN_FN2 | BUTTON_PIN_FN3), GPIO_Mode_In_PU_IT);
  EXTI_DeInit();
  EXTI_SelectPort(EXTI_Port_D);
  EXTI_SetPinSensitivity(EXTI_Pin_0, EXTI_Trigger_Rising_Falling);
  EXTI_SetPinSensitivity(EXTI_Pin_1, EXTI_Trigger_Rising_Falling);
  EXTI_SetPinSensitivity(EXTI_Pin_2, EXTI_Trigger_Rising_Falling);
  EXTI_SetPinSensitivity(EXTI_Pin_3, EXTI_Trigger_Rising_Falling);
#ifdef BUTTON_PIN_SB
  EXTI_SetPinSensitivity(EXTI_Pin_4, EXTI_Trigger_Rising_Falling);
#endif  
  EXTI_SetPinSensitivity(EXTI_Pin_6, EXTI_Trigger_Rising_Falling);
  EXTI_SetPinSensitivity(EXTI_Pin_7, EXTI_Trigger_Rising_Falling);
  
  EXTI_SelectPort(EXTI_Port_B);
  EXTI_SetPinSensitivity(EXTI_Pin_0, EXTI_Trigger_Rising_Falling);
  EXTI_SetPinSensitivity(EXTI_Pin_1, EXTI_Trigger_Rising_Falling);
  EXTI_SetPinSensitivity(EXTI_Pin_2, EXTI_Trigger_Rising_Falling);
  EXTI_SetPinSensitivity(EXTI_Pin_3, EXTI_Trigger_Rising_Falling);
  enableInterrupts();

  // Create all timers
  for( _btn = 0; _btn < keylstDummy; _btn++ ) {
    timer_create(&m_timer_id_btn_detet[_btn], _btn, btn_duration_timeout_handler);
    timer_create(&m_timer_id_double_btn_detet[_btn], _btn, double_btn_timeout_handler);
  }
  timer_create(&m_timer_id_debonce_detet, 0, btn_debonce_timeout_handler);
}

void SetFlashlight(uint8_t _st)
{
#ifdef ENABLE_FLASHLIGHT_LASER
  if( _st == DEVICE_SW_ON ) {
    ledFlashLight(SET);
  } else if( _st == DEVICE_SW_OFF ) {
    ledFlashLight(RESET);
  } else {
    ledToggleFlashLight;
  }
#endif  
}

void SetLasterBeam(uint8_t _st)
{
#ifdef ENABLE_FLASHLIGHT_LASER
  if( _st == DEVICE_SW_ON ) {
    ledLaserPen(SET);
  } else if( _st == DEVICE_SW_OFF ) {
    ledLaserPen(RESET);
  } else {
    ledToggleLaserPen;
  }
#endif  
}

void FN_Button_Action(uint8_t _fn) {
  uint8_t lv_curInd = gConfig.indDevice;
    
  for( uint8_t idx = 0; idx < NUM_DEVICES; idx++ ) {
    if( gConfig.fnScenario[_fn].bmDevice > 0 ) {
      // Verify deviceID and switch current device if matched
      if( gConfig.fnScenario[_fn].bmDevice & (0x01 << idx) ) {
        if( gConfig.devItem[idx].deviceID > 0 ) {
          gConfig.indDevice = idx;
        } else {
          continue;
        }
      } else {
        continue;
      }
    }
    
    if( gConfig.fnScenario[_fn].hue.State == DEVICE_SW_TOGGLE ) {
      CurrentDeviceOnOff = 1 - CurrentDeviceOnOff;
      Msg_DevOnOff(CurrentDeviceOnOff);
    } else if( gConfig.fnScenario[_fn].hue.State == DEVICE_SW_OFF ) {
      Msg_DevOnOff(DEVICE_SW_OFF);
    } else if( gConfig.fnScenario[_fn].hue.State == DEVICE_SW_ON ) {
      Msg_DevOnOff(DEVICE_SW_ON);
      if( gConfig.fnScenario[_fn].hue.CCT >= CT_MIN_VALUE ) {
        Msg_DevBR_CCT(gConfig.fnScenario[_fn].hue.BR, gConfig.fnScenario[_fn].hue.CCT);
      } else {
        Msg_DevBR_RGBW(gConfig.fnScenario[_fn].hue.BR, gConfig.fnScenario[_fn].hue.R, gConfig.fnScenario[_fn].hue.G, gConfig.fnScenario[_fn].hue.B, (uint8_t)gConfig.fnScenario[_fn].hue.CCT);
      }
    }
    
    if( gConfig.fnScenario[_fn].scenario > 0 ) {
      // Delay sending
      gSendDelayTick = 0;
      gSendScenario = gConfig.fnScenario[_fn].scenario;
    }
    
    if( gConfig.fnScenario[_fn].bmDevice == 0 ) break;
  }
  
