zhangqiaoli/xlightRemote-stm8l/Project/src/button.c
  // Restore Device Index
  gConfig.indDevice = lv_curInd;
}

void btn_short_button_press(uint8_t _btn)
{
  // Assert button
  if( !IS_VALID_BUTTON(_btn) ) return;
  
  switch( _btn ) {
  case keylstLeft:
    if( gConfig.inPresentation ) {
      // Turn screen black or restore
      Msg_PPT_ObjAction(PPT_OBJ_SCREEN, DEVICE_SW_TOGGLE);
    } else {
      // Reduce CCT and get warmmer white
      Msg_DevCCT(OPERATOR_SUB, BTN_STEP_SHORT_CCT);
    }
    break;
    
  case keylstRight:
    if( gConfig.inPresentation ) {
      // Start play or stop play
      Msg_PPT_ObjAction(PPT_OBJ_PAGE, DEVICE_SW_TOGGLE);
    } else {
      // Increase CCT and get colder white
      Msg_DevCCT(OPERATOR_ADD, BTN_STEP_SHORT_CCT);
    }
    break;
    
  case keylstUp:
    if( gConfig.inPresentation ) {
      // Page Up
      Msg_PPT_ObjAction(PPT_OBJ_PAGE, CONTENT_GO_PREV);
    } else {
      // more bright
      Msg_DevBrightness(OPERATOR_ADD, BTN_STEP_SHORT_BR);
      break;
    }
    
  case keylstDown:
    if( gConfig.inPresentation ) {
      // Page Down
      Msg_PPT_ObjAction(PPT_OBJ_PAGE, CONTENT_GO_NEXT);
    } else {
      // less bright
      Msg_DevBrightness(OPERATOR_SUB, BTN_STEP_SHORT_BR);
    }
    break;
    
  case keylstCenter:
    if( gConfig.inPresentation ) {
      // Next Page
      Msg_PPT_ObjAction(PPT_OBJ_PAGE, CONTENT_GO_NEXT);
    } else {
      // Toggle lights on/off
      //Msg_DevOnOff(CurrentDeviceOnOff == 0);
      Msg_DevOnOff(DEVICE_SW_TOGGLE);
    }
    break;
    
  case keylstFn1:
#ifdef ENABLE_SDTM
    // Pure Red
    Msg_DevBR_RGBW(60, 255, 0, 0, 0);
#else
    FN_Button_Action(0);
#endif
    break;
    
  case keylstFn2:
#ifdef ENABLE_SDTM
    // Pure Green
    Msg_DevBR_RGBW(60, 0, 255, 0, 0);
#else
    FN_Button_Action(1);
#endif
    break;
    
  case keylstFn3:
#ifdef ENABLE_SDTM
    // Pure Blue
    Msg_DevBR_RGBW(60, 0, 0, 255, 0);
#else
    FN_Button_Action(2);
#endif    
    break;
    
  case keylstFn4:
#ifdef ENABLE_SDTM
    // Pure White
    Msg_DevBR_RGBW(60, 0, 0, 0, 255);
#else
    FN_Button_Action(3);
#endif    
    break;

  case keylstFLASH:
#ifdef ENABLE_FLASHLIGHT_LASER    
    // Toggle the flash light
    ledToggleFlashLight;
#else
    Msg_RelayOnOff(DEVICE_SW_TOGGLE);
#endif    
    break;
    
  case keylstLASER:
#ifdef ENABLE_FLASHLIGHT_LASER    
    // Toggle laser pen
    ledToggleLaserPen;
#else
    Msg_RelayOnOff(DEVICE_SW_TOGGLE);
#endif    
    break;
    
  default:
    break;
  }
}

void btn_double_button_press(uint8_t _btn)
{
  // Assert button
  if( !IS_VALID_BUTTON(_btn) ) return;
  
  switch( _btn ) {
  case keylstLeft:
    if( gConfig.inPresentation ) {
      // Replay media
      Msg_PPT_ObjAction(PPT_OBJ_MEDIA, CONTENT_REPLAY);
    } else {
      Msg_DevCCT(OPERATOR_SET, CT_MIN_VALUE);
    }
    break;
    
  case keylstRight:
    if( gConfig.inPresentation ) {
      // Play media or stop play
      Msg_PPT_ObjAction(PPT_OBJ_MEDIA, DEVICE_SW_TOGGLE);
    } else {
      Msg_DevCCT(OPERATOR_SET, CT_MAX_VALUE);
    }
    break;
    
  case keylstUp:
    if( gConfig.inPresentation ) {
      // Last Page
      Msg_PPT_ObjAction(PPT_OBJ_PAGE, CONTENT_GO_LAST);
    } else {
      Msg_DevBrightness(OPERATOR_SET, 100);
    }
    break;
    
  case keylstDown:
    if( gConfig.inPresentation ) {
      // First Page
      Msg_PPT_ObjAction(PPT_OBJ_PAGE, CONTENT_GO_FIRST);
    } else {
      Msg_DevBrightness(OPERATOR_SET, BTN_BR_LOW);
    }
    break;
    
  case keylstCenter:
    // Toggle In-presentation flag
    SwitchPPTMode(!gConfig.inPresentation);
    break;
    
  case keylstFn1:
    break;
    
  case keylstFn2:
    break;
    
  case keylstFn3:
    break;
    
  case keylstFn4:
    break;

  case keylstFLASH:
    break;
    
  case keylstLASER:
    break;
    
  default:
    break;
  }  
}

void btn_long_hold_button_press(uint8_t _btn)
{
  // Assert button
  if( !IS_VALID_BUTTON(_btn) ) return;
  
  switch( _btn ) {
  case keylstLeft:
    break;
    
  case keylstRight:
    break;
    
  case keylstUp:
    break;
    
  case keylstDown:
    break;
    
  case keylstCenter:
    // Turn on the laser
    SetLasterBeam(DEVICE_SW_ON);
    break;
    
  case keylstFn1:
    break;
    
  case keylstFn2:
    break;
    
  case keylstFn3:
    break;
    
  case keylstFn4:
    break;
    
  case keylstFLASH:
    break;
    
  case keylstLASER:
    break;
    
  default:
    break;
  }  
}

void btn_long_button_press(uint8_t _btn)
{
  // Assert button
  if( !IS_VALID_BUTTON(_btn) ) return;
  
  switch( _btn ) {
  case keylstLeft:
    if( gConfig.inPresentation ) {
      // Media FB (Fast Backward)
      Msg_PPT_ObjAction(PPT_OBJ_MEDIA, CONTENT_FAST_BACKWARD);
    } else {
      // Reduce CCT and get warmmer white
      Msg_DevCCT(OPERATOR_SUB, BTN_STEP_LONG_CCT);
    }
    break;
    
  case keylstRight:
    if( gConfig.inPresentation ) {
      // Media FF (Fast Forward)
      Msg_PPT_ObjAction(PPT_OBJ_MEDIA, CONTENT_FAST_FORWARD);
    } else {
      // Increase CCT and get colder white
      Msg_DevCCT(OPERATOR_ADD, BTN_STEP_LONG_CCT); 
    }
    break;
    
  case keylstUp:
    if( gConfig.inPresentation ) {
      // n Pages Up
      Msg_PPT_ObjAction(PPT_OBJ_PAGE, CONTENT_FAST_BACKWARD);
    } else {
      // more bright
      Msg_DevBrightness(OPERATOR_ADD, BTN_STEP_LONG_BR);
    }
    break;
    
  case keylstDown:
    if( gConfig.inPresentation ) {
      // n Pages Down
      Msg_PPT_ObjAction(PPT_OBJ_PAGE, CONTENT_FAST_FORWARD);
    } else {
      // less bright
      Msg_DevBrightness(OPERATOR_SUB, BTN_STEP_LONG_BR);
    }
    break;
    
  case keylstCenter:
    // Turn off the laser
    SetLasterBeam(DEVICE_SW_OFF);
    break;
    
  case keylstFn1:
    // Toggle In-presentation flag
    //SwitchPPTMode(!gConfig.inPresentation);
    break;
    
  case keylstFn2:
    break;
    
  case keylstFn3:
    break;
    
  case keylstFn4:
    break;
    
  case keylstFLASH:
    break;
    
  case keylstLASER:
    break;
    
  default:
    break;
  }
}

void btn_very_long_hold_button_press(uint8_t _btn)
{
  // Assert button
  if( !IS_VALID_BUTTON(_btn) ) return;
  
  switch( _btn ) {
  case keylstLeft:
    break;
    
  case keylstRight:
    break;
    
