zhangqiaoli/xlightRemote-stm8l/Project/src/button.c
  case keylstUp:
    break;
    
  case keylstDown:
    break;
    
  case keylstCenter:
    break;
    
  case keylstFn1:
    break;
    
  case keylstFn2:
    // Soft reset
    //WWDG->CR = 0x80;
    break;
    
  case keylstFn3:
    // Erase current device infomation
    //EraseCurrentDeviceInfo();
    break;
    
  case keylstFn4:
    break;
  
  case keylstFLASH:
    // Soft reset
    WWDG->CR = 0x80;
    break;
  
  case keylstLASER:
    break;
    
  default:
    break;
  }
}

void btn_very_long_button_press(uint8_t _btn)
{
  // Assert button
  if( !IS_VALID_BUTTON(_btn) ) return;
  
  switch( _btn ) {
  case keylstLeft:
    break;
    
  case keylstRight:
    break;
    
  case keylstUp:
    break;
    
  case keylstDown:
    break;
    
  case keylstCenter:
    // Turn off the laser
    SetLasterBeam(DEVICE_SW_OFF);
    break;
    
  case keylstFn1:
    break;
    
  case keylstFn2:
    break;
    
  case keylstFn3:
    break;
    
  case keylstFn4:
    break;
    
  case keylstFLASH:
    break;
    
  case keylstLASER:
    break;
    
  default:
    break;
  }
}

void btn_double_long_hold_press(uint8_t _btn1, uint8_t _btn2)
{
  // Assert button
  if( !IS_VALID_BUTTON(_btn1) || !IS_VALID_BUTTON(_btn2) ) return;
  
  /*
  if( _btn1 == keylstCenter && _btn2 == keylstRight ) {
    // Change current device
    ChangeCurrentDevice(gConfig.indDevice+1);
  }*/
  if( _btn1 == keylstFLASH ) {
    if( _btn2 == keylstFn1 ) {
      // Erase current device infomation
      EraseCurrentDeviceInfo();      
    } else if( _btn2 == keylstFn2 ) {
      // Switch to Config Mode (no entering low power mode for a while)
      SetConfigMode(TRUE, gConfig.indDevice);
    } else if( _btn2 == keylstFn4 ) {
      // Toggle Simple Direct Test Mode
      ToggleSDTM();
    }
  }
}

void app_button_event_handler(uint8_t _btn, button_event_t button_event)
{
  uint8_t sec_btn = keylstDummy;
  
  switch (button_event)
  {
  case BUTTON_INVALID:
    break;
    
  case BUTTON_SHORT_PRESS:
    btn_short_button_press(_btn);
    break;
    
  case BUTTON_DOUBLE_PRESS:
    btn_double_button_press(_btn);
    break;
    
  case BUTTON_LONG_HOLD:
    btn_long_hold_button_press(_btn);
    break;
    
  case BUTTON_LONG_PRESS:
    btn_long_button_press(_btn);
    break;
    
  case BUTTON_VERY_LONG_HOLD:
    btn_very_long_hold_button_press(_btn);
    break;
    
  case BUTTON_VERY_LONG_PRESS:
    btn_very_long_button_press(_btn);
    break;
    
  case DOUBLE_BTN_TRACK:
    if( btn_is_pushed[keylstFn1] ) sec_btn = keylstFn1;
    else if( btn_is_pushed[keylstFn2] ) sec_btn = keylstFn2;
    else if( btn_is_pushed[keylstFn3] ) sec_btn = keylstFn3;
    else if( btn_is_pushed[keylstFn4] ) sec_btn = keylstFn4;
    if( sec_btn < keylstDummy )
      btn_double_long_hold_press(keylstFLASH, sec_btn);
    
  default:
    break;
  }
}

// Only use button1_timer to track double button long hold.
void check_track_double_button(void)
{
  if( btn_is_pushed[keylstFLASH] == TRUE && btn_is_pushed[keylstFn1] == TRUE )
  {
    timer_stop(m_timer_id_btn_detet[keylstFn1]);  // Disable btn2_timer when tracking double hold.
    m_btn_timer_status[keylstFLASH] = BUTTON_STATUS_DOUBLE_TRACK;
    m_btn_timer_status[keylstFn1] = BUTTON_STATUS_INIT;
    double_button_track = TRUE;
    timer_start(m_timer_id_btn_detet[keylstFn1], BUTTON_DOUBLE_BTN_TRACK_DURATION);  //3 s
  } else if( btn_is_pushed[keylstFLASH] == TRUE && btn_is_pushed[keylstFn4] == TRUE ) {
    timer_stop(m_timer_id_btn_detet[keylstFn4]);  // Disable btn2_timer when tracking double hold.
    m_btn_timer_status[keylstFLASH] = BUTTON_STATUS_DOUBLE_TRACK;
    m_btn_timer_status[keylstFn4] = BUTTON_STATUS_INIT;
    double_button_track = TRUE;
    timer_start(m_timer_id_btn_detet[keylstFn4], BUTTON_DOUBLE_BTN_TRACK_DURATION);  //3 s
  } else {
    if (double_button_track == TRUE)
    {
      m_btn_timer_status[keylstFLASH] = BUTTON_STATUS_INIT;
      m_btn_timer_status[keylstFn1] = BUTTON_STATUS_INIT;
      m_btn_timer_status[keylstFn4] = BUTTON_STATUS_INIT;
      double_button_track = FALSE;
      timer_stop(m_timer_id_btn_detet[keylstFn1]);
      timer_stop(m_timer_id_btn_detet[keylstFn4]);
    }
  }
}

void button_push(uint8_t _btn)
{
  // Assert button
  if( !IS_VALID_BUTTON(_btn) ) return;
  
  btn_is_pushed[_btn] = TRUE;
  check_track_double_button();
  
  if (double_button_track == FALSE)
  {
    m_btn_timer_status[_btn] = BUTTON_STATUS_LESS_2S;
    timer_start(m_timer_id_btn_detet[_btn], BUTTON_WAIT_2S);
  }
}

void button_release(uint8_t _btn)
{
  // Assert button
  if( !IS_VALID_BUTTON(_btn) ) return;
  
  btn_is_pushed[_btn] = FALSE;
  button_event_t button_event = BUTTON_INVALID;
  
  check_track_double_button();
  
  switch (m_btn_timer_status[_btn])
  {
  case BUTTON_STATUS_INIT:
    break;
    
  case BUTTON_STATUS_LESS_2S:
    if (detect_double_btn_press[_btn] == FALSE)
    {
      detect_double_btn_press[_btn] = TRUE;
      timer_start(m_timer_id_double_btn_detet[_btn], BUTTON_DOUBLE_BTN_DURATION);  // 500ms
    }
    else
    {
      button_event = BUTTON_DOUBLE_PRESS;
      detect_double_btn_press[_btn] = FALSE;
      timer_stop(m_timer_id_double_btn_detet[_btn]);
    }
    break;
    
  case BUTTON_STATUS_MORE_2S:
    button_event = BUTTON_LONG_PRESS;
    break;
    
  case BUTTON_STATUS_MORE_5S:
    button_event = BUTTON_VERY_LONG_PRESS;
    break;
    
  default:
    break;
  }
  
  m_btn_timer_status[_btn] = BUTTON_STATUS_INIT;
  if (button_event != BUTTON_INVALID) {
    app_button_event_handler(_btn, button_event);
  }
}

void button_event_handler(uint8_t _pin)
{
  tmrIdleDuration = 0;
  button_first_detect_status = GPIO_ReadInputData(BUTTONS_PORT1);
  button_first_detect_status <<= 8;
  button_first_detect_status |= GPIO_ReadInputData(BUTTONS_PORT2);
  timer_start(m_timer_id_debonce_detet, BUTTON_DEBONCE_DURATION);
  
  // Check Flashlight
  /*
  static BitStatus keyFL = 0;
  if( _pin == GPIO_Pin_0 ) {
    if( keyFL != pinKeySA ) {
      keyFL = pinKeySA;
      // Set Flashlight
      ledFlashLight(keyFL);
    }
  }*/
}
